DataProcessors/ИА_РаботаСГлоссарием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_РаботаСГлоссарием</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Слова</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Слово</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Определения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДляПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Слово</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Определения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ИА_Определения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Определения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Определение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склонения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Слово</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_СпискиДляПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_СпискиДляПечати</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокСлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Слово</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Определения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИА_РаботаСГлоссарием/Forms/ФормаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура СловоПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыРаспреденияПриИзменении(Элемент)
    Слово = "";	
	ОбновитьСписок();
	ПолеHTML_Просмотр = "";
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_Определения.Ссылка КАК Слово
	               |ИЗ
	               |	Справочник.ИА_Определения КАК ИА_Определения
	               |ГДЕ
	               |	(ИА_Определения.КодыРаспределения.КодРаспределения В (&КодРаспределения)
	               |			ИЛИ &НеОтбиратьПоКоду)
	               |	И (ИА_Определения.Наименование ПОДОБНО &Наименование ИЛИ &СловоДляПоиска="""")
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_Определения.Наименование";
	Запрос.УстановитьПараметр("КодРаспределения", КодыРаспредения.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СловоДляПоиска", СокрЛП(Слово));
	Запрос.УстановитьПараметр("Наименование", "%" + СокрЛП(Слово)+"%");
	Запрос.УстановитьПараметр("НеОтбиратьПоКоду", КодыРаспредения.Количество()=0);
	
	СписокСлов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Слово"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСловПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокСлов.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВыбранноеСлово = ТекущиеДанные.Значение;
		
		ОпределениеТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеОпределения(ВыбранноеСлово);
		НовыйТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ВставитьСсылкиНаОпределения(ОпределениеТекст, ВыбранноеСлово);
			
		ПолеHTML_Просмотр = НовыйТекст;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокСловДляПечатиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокСловДляПечати.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВыбранноеСлово = ТекущиеДанные.Значение;
		НовыйТекст ="";
		
		Если ЗначениеЗаполнено(ВыбранноеСлово) Тогда
			
			ОпределениеТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеОпределения(ВыбранноеСлово);
			НовыйТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ВставитьСсылкиНаОпределения(ОпределениеТекст, ВыбранноеСлово);

		КонецЕсли;
		
		ПолеHTML_Просмотр = НовыйТекст;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСлово(Команда)
	тд = Элементы.СписокСлов.ТекущиеДанные;
	Если тд <> Неопределено Тогда
		ВыбранноеСлово = тд.Значение;
		Если СписокСловДляПечати.НайтиПоЗначению(ВыбранноеСлово)=Неопределено Тогда
			СписокСловДляПечати.Добавить(ВыбранноеСлово);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВТекущийСписок(Команда)
	
	тд = Элементы.СпискиДляПечати.ТекущиеДанные;
	Если тд<>Неопределено тогда
		
		МассивСлов = Новый Массив;
		
		Для Каждого стр из СписокСловДляПечати Цикл
			МассивСлов.Добавить(стр.Значение);
		КонецЦикла;
		
		ДобавитьВСписокНаСервере(МассивСлов, тд.Ссылка);
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Функция ДобавитьВСписокНаСервере(МассивСлов, СписокСсылкаНаименование)
	
	Если ТипЗнч(СписокСсылкаНаименование) = Тип("Строка") Тогда
		// создаем новый список
		Спр = Справочники.ИА_СпискиДляПечати.СоздатьЭлемент();
		Спр.Наименование = СписокСсылкаНаименование;
	Иначе
		Спр = СписокСсылкаНаименование.ПолучитьОбъект();
	КонецЕсли;
	
	
	Спр.СписокСлов.Очистить();
	Для Каждого стрСлово из МассивСлов Цикл
		Если Спр.СписокСлов.Найти(стрСлово)=Неопределено Тогда
			Спр.СписокСлов.Добавить().Слово = стрСлово;
		КонецЕсли;
	КонецЦикла;
	
	Спр.Записать();
	
	Возврат Спр.Ссылка;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВНовыйСписок(Команда)
	
	ИмяСписка = "Новый список";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("СохранитьВНовыйСписокЗавершение", ЭтотОбъект, Новый Структура("ИмяСписка", ИмяСписка)), ИмяСписка);

	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВНовыйСписокЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	ИмяСписка = ?(Строка = Неопределено, ДополнительныеПараметры.ИмяСписка, Строка);
	
	
	Если (Строка <> Неопределено) Тогда
		
		МассивСлов = Новый Массив;
		
		Для Каждого стр из СписокСловДляПечати Цикл
			МассивСлов.Добавить(стр.Значение);
		КонецЦикла;
		
		СписокСсылка = ДобавитьВСписокНаСервере(МассивСлов, ИмяСписка);
		
		Элементы.СпискиДляПечати.Обновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТекущегоСписка(Команда)
	
	тд = Элементы.СпискиДляПечати.ТекущиеДанные;
	Если тд<>Неопределено тогда
		ЗагрузитьИзСпискаНаСервере(тд.Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзТекущегоСписка(Команда)
	тд = Элементы.СпискиДляПечати.ТекущиеДанные;
	Если тд<>Неопределено тогда
		ЗагрузитьИзСпискаНаСервере(тд.Ссылка, Ложь);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьИзСпискаНаСервере(Ссылка, Очищать)
	
	Если Очищать Тогда
		СписокСловДляПечати.Очистить();
	КонецЕсли;
	
	Для Каждого Стр из Ссылка.СписокСлов Цикл
		Если СписокСловДляПечати.НайтиПоЗначению(Стр.Слово) = Неопределено Тогда
			СписокСловДляПечати.Добавить(Стр.Слово);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокСловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранноеСлово = Элемент.ДанныеСтроки(ВыбраннаяСтрока).Значение;
	
	Если СписокСловДляПечати.НайтиПоЗначению(ВыбранноеСлово)=Неопределено Тогда
		СписокСловДляПечати.Добавить(ВыбранноеСлово);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокСловВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСписка(Команда)
	
	Если СписокСловДляПечати.Количество()>0 Тогда
		Ф = ПолучитьФорму("ОбщаяФорма.ИА_ПечатьДолжностнойИнструкцииУправляемая");
		Для каждого стр из СписокСловДляПечати Цикл
			ф.СписокСлов.Добавить(стр.Значение);
		КонецЦикла;
		ф.Открыть();
	КонецЕсли;	// Вставить содержимое обработчика.

КонецПроцедуры

//&НаСервереБезКонтекста 
//Функция ПолучитьВложенияОпределения(Определение)
//  Возврат Справочники.ИА_Определения.ПолучитьВложенияОпределения(Определение);
//КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		ПодключитьРасширениеРаботыСФайлами();
	#КонецЕсли
КонецПроцедуры
